zhaohad/KeilProjects/电子资料/G01-S/Demo程序/demo_SI24R1/demo_SI24R1/Demo_nRF24L01_V3_0_ZeYao/Demo_RF24L01_Stm8L101/Project_RF24L01/Source_Files/drv_mcu/inc/drv_spi.h
/**
  ******************************************************************************
  * @author  
  * @version 
  * @date    
  * @brief   
  ******************************************************************************
  * @attention
  *
  * 
  * 
  * 
  ******************************************************************************
  */


#ifndef __DRV_SPI_H__
#define __DRV_SPI_H__


#ifndef __USE_SOFT_SPI_INTERFACE__
#include "stm8l10x_clk.h"
#endif
#include "stm8l10x_gpio.h"
#include "stm8l10x_spi.h"
#include "main.h"


//SPI硬件接口IO定义
#define SPI_CLK_GPIO_PORT			GPIOB
#define SPI_CLK_GPIO_PIN			GPIO_Pin_5

#define SPI_MISO_GPIO_PORT			GPIOB
#define SPI_MISO_GPIO_PIN			GPIO_Pin_7

#define SPI_MOSI_GPIO_PORT			GPIOB
#define SPI_MOSI_GPIO_PIN			GPIO_Pin_6

#define SPI_NSS_GPIO_PORT			GPIOB
#define SPI_NSS_GPIO_PIN			GPIO_Pin_4


#define spi_set_nss_high( )			GPIO_SetBits( SPI_NSS_GPIO_PORT, SPI_NSS_GPIO_PIN )		//NSS置高，取消片选
#define spi_set_nss_low( )			GPIO_ResetBits( SPI_NSS_GPIO_PORT, SPI_NSS_GPIO_PIN )	//NSS置低，片选从设备



#ifdef __USE_SOFT_SPI_INTERFACE__					
/** 软件模拟SPI操作函数定义 */

#define spi_set_clk_high( )			GPIO_SetBits( SPI_CLK_GPIO_PORT, SPI_CLK_GPIO_PIN )		//时钟置高
#define spi_set_clk_low( )			GPIO_ResetBits( SPI_CLK_GPIO_PORT, SPI_CLK_GPIO_PIN )	//时钟置低

#define spi_set_mosi_hight( )		GPIO_SetBits( SPI_MOSI_GPIO_PORT, SPI_MOSI_GPIO_PIN )	//输出置高（主机）
#define spi_set_mosi_low( )			GPIO_ResetBits( SPI_MOSI_GPIO_PORT, SPI_MOSI_GPIO_PIN )	//输出置低（主机）

#define spi_get_miso( )				( 0 == GPIO_ReadInputDataBit( SPI_MISO_GPIO_PORT, SPI_MISO_GPIO_PIN )) ? 0 : 1 // 读取输入状态

#endif


void drv_spi_init( void );
uint8_t drv_spi_read_write_byte( uint8_t TxByte );
void drv_spi_read_write_string( uint8_t* ReadBuffer, uint8_t* WriteBuffer, uint16_t Length );


#endif

